## Pandas

In [1]:
import pandas as pd

In [3]:
## Series

data=[1,2,3,4,5]
series=pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
## Create a series from dictionary

data={'a':1,'b':2,'c':3}
series=pd.Series(data)
series

a    1
b    2
c    3
dtype: int64

In [24]:
## DataFrame
data={
    'Name':['Krish','JOhn','Karl'],
    'Age': [24,54,65],
    'City':['Pune','New york','Florida']
}
df=pd.DataFrame(data)
print(df)

    Name  Age      City
0  Krish   24      Pune
1   JOhn   54  New york
2   Karl   65   Florida

In [21]:
## Create a dataframe from a list of dictionaries

Data=[
    {'Name':'Krish','Age':32,'City':'Pune'},
    {'Name':'Sagar','Age':22,'City':'Banglore'},
    {'Name':'Dj','Age':42,'City':'Pune'},
    {'Name':'Pammu','Age':34,'City':'Mumbai'}
]
df=pd.DataFrame(Data)
print(df)

    Name  Age      City
0  Krish   32      Pune
1  Sagar   22  Banglore
2     Dj   42      Pune
3  Pammu   34    Mumbai

In [ ]:
## how to read Different types of files

# pd.read_csv('File name\Path')

In [ ]:
## Acessing the element
df
df['Name']

0    Krish
1     JOhn
2     Karl
Name: Name, dtype: object

In [ ]:
df.loc[0] ## For accessing row index

Name    Krish
Age        24
City     Pune
Name: 0, dtype: object

In [29]:
df.iloc[0]

Name    Krish
Age        24
City     Pune
Name: 0, dtype: object

In [32]:
## Accessing the specified element

df.at[1,'Age']

np.int64(54)

In [33]:
df.iat[2,2]

'Florida'

In [34]:
## Data Manipulation 

df

    Name  Age      City
0  Krish   24      Pune
1   JOhn   54  New york
2   Karl   65   Florida

In [35]:
df['Salary']=[50000,60000,650000]
df

    Name  Age      City  Salary
0  Krish   24      Pune   50000
1   JOhn   54  New york   60000
2   Karl   65   Florida  650000

In [ ]:
## remove a column
df.drop('Salary',axis=1) ## Here it will be drop for just these operation

## In order to drop the column permanently used inplace option

df.drop('Salary',axis=1,inplace=True)

In [41]:
df

    Name  Age      City
0  Krish   24      Pune
1   JOhn   54  New york
2   Karl   65   Florida

In [45]:
## ADD a age to column

df['Age']=df['Age']+1
df

    Name  Age      City
0  Krish   28      Pune
1   JOhn   58  New york
2   Karl   69   Florida